Repository: davemccrea/edenflowers_store
Catalog: priv/gettext/*/LC_MESSAGES/default.po
Languages: fi

source: Actions
fi: Toiminnot

source: About
fi: Tietoa meistä

source: Address not found
fi: Osoitetta ei löytynyt

source: Apply
fi: Käytä

source: Cart
fi: Ostoskori

source: Condolences
fi: Suruvalittelut

source: Contact
fi: Yhteystiedot

source: Courses
fi: Kurssit

source: Delivery
fi: Toimitus

source: Discount
fi: Alennus

source: Free
fi: Ilmainen

source: Gift Message
fi: Lahjaviesti

source: Next month
fi: Seuraava kuukausi

source: Previous month
fi: Edellinen kuukausi

source: Show current month
fi: Näytä nykyinen kuukausi

source: Store
fi: Kauppa

source: Total
fi: Yhteensä

source: Weddings
fi: Häät

source: Enjoy 20% off your next order and get occassional floral advice in your inbox.
fi: Saat 20% alennuksen seuraavasta tilauksestasi ja satunnaisia kukkavinkkejä sähköpostiisi.

source: Fresh flowers for everyday moments.
fi: Tuoreita kukkia arkipäivän hetkiin.

source: Let us know what you think of the new website! 🚀
fi: Kerro meille mitä mieltä olet uudesta verkkosivustosta! 🚀

source: Crafted for those with discerning taste, our flowers blend quality and style and arrive perfectly arranged at your door.
fi: Valmistettu hienostuneille maistajille, kukkamme yhdistävät laadun ja tyylin ja saapuvat täydellisesti järjestettyinä ovellesi.

source: Checkout
fi: Kassa

source: Payment
fi: Maksu

source: Phone Number
fi: Puhelinnumero

source: %{count} spot available
fi: %{count} paikka vapaana

source: %{count} spot remaining
fi: %{count} paikka jäljellä

source: Account
fi: Tili

source: Add to Cart
fi: Lisää ostoskoriin

source: Built with
fi: Rakennettu

source: Can I include a personal message with my order?
fi: Voinko sisällyttää henkilökohtaisen viestin tilaukseeni?

source: Check back soon for new workshops and courses.
fi: Tarkista pian uudet työpajat ja kurssit.

source: Complete sign in
fi: Viimeistele kirjautuminen

source: Decrement
fi: Vähennä

source: Delivery Information
fi: Toimitus­tiedot

source: Disconnected from server. Reconnecting...
fi: Yhteys palvelimeen katkennut. Yhdistetään uudelleen...

source: Do you offer subscription services?
fi: Tarjoatteko tilauspalveluita?

source: Email
fi: Sähköposti

source: Email *
fi: Sähköposti *

source: Error sending magic link. Please try again later.
fi: Virhe kirjautumislinkin lähetyksessä. Yritä myöhemmin uudelleen.

source: Error signing in. Please try again later.
fi: Virhe kirjautuessa. Yritä myöhemmin uudelleen.

source: Featured Blooms
fi: Esittelyssä

source: Frequently Asked Questions
fi: Usein kysytyt kysymykset

source: Get Magic Link
fi: Hanki kirjautumislinkki

source: Gift Options
fi: Lahjavalinnat

source: Home
fi: Etusivu

source: How long will my flowers stay fresh?
fi: Kuinka kauan kukkani pysyvät tuoreina?

source: Increment
fi: Lisää

source: Learn more
fi: Lue lisää

source: Learn the art of flower arranging with our hands-on workshops. Each course is designed to inspire creativity and develop your skills.
fi: Opi kukka-asetelmi­en taide käytännön työpajoissa. Jokainen kurssi on suunniteltu inspiroimaan luovuutta ja kehittämään taitojasi.

source: No upcoming courses
fi: Ei tulevia kursseja

source: Open navigation menu
fi: Avaa navigointivalikko

source: Order #1234
fi: Tilaus #1234

source: Our delivery team will attempt to leave your flowers in a safe, shaded location. If no suitable location is available, they will leave a note with instructions for redelivery. You can also specify delivery instructions during checkout.
fi: Toimitustiimimme yrittää jättää kukkasi turvalliseen varjoiseen paikkaan. Jos sopivaa paikkaa ei ole, he jättävät ohjeet uudelleen toimitusta varten. Voit myös määrittää toimitusohjeita kassalla.

source: Our flowers are carefully selected and arranged to last 5-7 days with proper care. We recommend changing the water every 2-3 days, trimming the stems, and keeping them away from direct sunlight and drafts.
fi: Kukkamme on huolellisesti valittu ja järjestetty kestämään 5-7 päivää oikealla hoidolla. Suosittelemme veden vaihtamista 2-3 päivän välein, varsien leikkaamista ja pitämistä poissa suorasta auringonvalosta ja vedosta.

source: Outside delivery range
fi: Toimitusalueen ulkopuolella

source: Pickup Date *
fi: Noutopäivä *

source: Please check your email to complete sign in.
fi: Tarkista sähköpostisi viimeistelläksesi kirjautumisen.

source: Popular
fi: Suositut

source: Promo Code
fi: Tarjouskoodi

source: Recipient *
fi: Vastaanottaja *

source: Recipient Name *
fi: Vastaanottajan nimi *

source: Register Now
fi: Ilmoittaudu nyt

source: Registration Closed
fi: Ilmoittautuminen suljettu

source: Registration closed on
fi: Ilmoittautuminen sulkeutui

source: Registration closes
fi: Ilmoittautuminen sulkeutuu

source: Remove
fi: Poista

source: Secure Checkout
fi: Turvallinen kassa

source: Select Size
fi: Valitse koko

source: Sign In
fi: Kirjaudu sisään

source: Sign in
fi: Kirjaudu sisään

source: Sign in to your account
fi: Kirjaudu tilillesi

source: There was a problem calculating delivery cost, please try again later
fi: Toimituskulujen laskemisessa tapahtui virhe, yritä myöhemmin uudelleen

source: There was an error subscribing to the newsletter.
fi: Uutiskirjeen tilaamisessa tapahtui virhe.

source: We offer same-day delivery for orders placed before 2 PM on weekdays. For weekend deliveries, please place your order by Friday 2 PM. All our deliveries are carefully handled to ensure your flowers arrive in perfect condition.
fi: Tarjoamme saman päivän toimituksen tilauksille, jotka on tehty ennen klo 14 arkisin. Viikonlopputoimituksiin, tee tilauksesi perjantaihin klo 14 mennessä. Kaikki toimituksemme käsitellään huolellisesti varmistaaksemme, että kukkasi saapuvat täydellisessä kunnossa.

source: What happens if I'm not home for delivery?
fi: Mitä tapahtuu, jos en ole kotona toimituksen aikana?

source: What is your delivery policy?
fi: Mikä on toimituspolitiikkanne?

source: Yes! You can add a personal message during checkout. We'll include it on a beautiful card with your delivery. Messages can be up to 200 characters.
fi: Kyllä! Voit lisätä henkilökohtaisen viestin kassalla. Sisällytämme sen kauniiseen korttiin toimituksen mukana. Viestit voivat olla enintään 200 merkkiä.

source: Yes, we offer weekly, bi-weekly, and monthly subscription services. You can customize your subscription to match your preferences and schedule. Subscribers receive a 10% discount on all orders.
fi: Kyllä, tarjoamme viikottaisia, kahden viikon välein ja kuukausittaisia tilauspalveluita. Voit mukauttaa tilauksesi mieltymyksesi ja aikataulusi mukaan. Tilaajat saavat 10 % alennuksen kaikista tilauksista.

source: You've been subscribed to the newsletter 🥳.
fi: Olet tilannut uutiskirjeen 🥳.

source: Your Details
fi: Tietosi

source: Your Name *
fi: Nimesi *

source: Your cart is empty.
fi: Ostoskorisi on tyhjä.

source: 🥳 A magic link was sent to %{email}.
fi: 🥳 Kirjautumislinkki lähetettiin osoitteeseen %{email}.

source: Order Confirmation
fi: Tilausvahvistus
