Repository: davemccrea/edenflowers_store
Catalog: priv/gettext/*/LC_MESSAGES/errors.po
Languages: fi, sv

source: can't be blank
fi: ei voi olla tyhjä
sv: får inte vara tom

source: has already been taken
fi: on jo käytössä
sv: är redan tagen

source: is invalid
fi: on virheellinen
sv: är ogiltig

source: must be accepted
fi: on hyväksyttävä
sv: måste accepteras

source: has invalid format
fi: on väärässä muodossa
sv: har ogiltigt format

source: has an invalid entry
fi: sisältää virheellisen merkinnän
sv: har en ogiltig post

source: is reserved
fi: on varattu
sv: är reserverad

source: does not match confirmation
fi: ei vastaa vahvistusta
sv: matchar inte bekräftelsen

source: is still associated with this entry
fi: on edelleen liitetty tähän merkintään
sv: är fortfarande associerad med denna post

source: are still associated with this entry
fi: ovat edelleen liitetty tähän merkintään
sv: är fortfarande associerade med denna post

source: should have %{count} item(s)
fi: pitäisi olla %{count} kohde
sv: bör ha %{count} objekt

source: should be %{count} character(s)
fi: pitäisi olla %{count} merkki
sv: bör vara %{count} tecken

source: should be %{count} byte(s)
fi: pitäisi olla %{count} tavu
sv: bör vara %{count} byte

source: should have at least %{count} item(s)
fi: pitäisi olla vähintään %{count} kohde
sv: bör ha minst %{count} objekt

source: should be at least %{count} character(s)
fi: pitäisi olla vähintään %{count} merkki
sv: bör vara minst %{count} tecken

source: should be at least %{count} byte(s)
fi: pitäisi olla vähintään %{count} tavu
sv: bör vara minst %{count} byte

source: should have at most %{count} item(s)
fi: pitäisi olla enintään %{count} kohde
sv: bör ha högst %{count} objekt

source: should be at most %{count} character(s)
fi: pitäisi olla enintään %{count} merkki
sv: bör vara högst %{count} tecken

source: should be at most %{count} byte(s)
fi: pitäisi olla enintään %{count} tavu
sv: bör vara högst %{count} byte

source: must be less than %{number}
fi: on oltava pienempi kuin %{number}
sv: måste vara mindre än %{number}

source: must be greater than %{number}
fi: on oltava suurempi kuin %{number}
sv: måste vara större än %{number}

source: must be less than or equal to %{number}
fi: on oltava pienempi tai yhtä suuri kuin %{number}
sv: måste vara mindre än eller lika med %{number}

source: must be greater than or equal to %{number}
fi: on oltava suurempi tai yhtä suuri kuin %{number}
sv: måste vara större än eller lika med %{number}

source: must be equal to %{number}
fi: on oltava yhtä suuri kuin %{number}
sv: måste vara lika med %{number}

source: is required
fi: on pakollinen
sv: är obligatorisk
